meeting/minutes/2026/07-14.org
:PROPERTIES:
:ID:       80496E18-9FE5-4B05-977F-ABB77C1D79C6
:END:
#+title: QT4 CG Meeting 172 Minutes 2026-07-14
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Meeting index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

#+TOC: headlines 6

* Summary of new and continuing actions [0/9]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:ID:       E163C5FF-35A6-42C7-97C1-26018A7A55D1
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid
+ [ ] QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string
+ [ ] QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes
+ [ ] QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind
+ [ ] QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.
+ [ ] QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed
+ [ ] QT4CG-170-01: RD to draft a proposal that attempts to address the lexical issues differently.
+ [ ] QT4CG-172-01: MK to check if the XSLT rules are consistent with the rules in #2757.

* Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:ID:       0BDB88A2-D60E-4433-989D-7C30746646D1
:END:

Approved [[../2026/07-21.html][at meeting 173]] on 21 July 2026.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:ID:       F0ED304A-B587-4287-BF0F-CDE26E92E3BE
:END:

** Roll call [7/11]
:PROPERTIES:
:CUSTOM_ID: roll-call
:ID:       7815DDD1-075E-4C88-9A31-FD67706BCBC0
:END:

JWL, BTW, WP give regrets.

+ [X] David J Birnbaum (DB)
+ [ ] Reece Dunn (RD)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK)
+ [X] Michael Kay (MK)
+ [X] Juri Leino (JLO)
+ [ ] John Lumley (JWL)
+ [X] Alan Painter (AP)
+ [ ] Wendell Piez (WP)
+ [ ] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW) /Scribe/. /Chair/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:ID:       9E01AE79-8B33-4350-A30B-0434746BB39C
:END:

Proposal: Accept [[../../agenda/2026/07-14.html][the agenda]].

Accepted.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:ID:       3C647E5A-D1C7-4827-B402-82AF780C4C27
:END:

Proposal: Accept [[../../minutes/2026/07-07.html][the minutes of the previous meeting]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:ID:       8AB5EF3E-FFE6-4BE5-9EC6-FB0C5D9FFFB1
:END:

The next meeting is planned for 21 July.

No regrets heard

** Review of open action items [1/9]
:PROPERTIES:
:CUSTOM_ID: open-actions
:ID:       AD7E58EB-760F-427C-93D2-A6F2ADF2D7AA
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [X] QT4CG-167-01: DB to write a PR for #2641, comments in CSV
  + Overtaken by events, see [[https://qt4cg.org/dashboard/#pr-2778][#2778]].
+ [ ] QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid
+ [ ] QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string
+ [ ] QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes
+ [ ] QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind
+ [ ] QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.
+ [ ] QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed
+ [ ] QT4CG-170-01: RD to draft a proposal that attempts to address the lexical issues differently.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:ID:       A46B5248-F9BC-4A54-A43C-A8D7E6587DFF
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:ID:       0516A6B7-43CC-4587-88FB-5764ADF559DE
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2594][#2594]]: 2389 Adaptive Serialization: more freedom
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update

