meeting/minutes/2026/07-14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 172 Minutes 2026-07-14</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 172 Minutes 2026-07-14</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/9]</code></a></li>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[7/11]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[1/9]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
<li><a href="#close-without-action">1.6.3. Close without action</a></li>
<li><a href="#substantive">1.6.4. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#pr-2784">2.1. PR #2784: 2783 fn:pad-string</a></li>
<li><a href="#pr-2778">2.2. PR #2778: 2641b Add support for CSV comments</a></li>
<li><a href="#pr-2777">2.3. PR #2777: 2644 Extend casts to sequences, arrays, maps, and records</a></li>
<li><a href="#pr-2768">2.4. PR #2768: 2740 Drop constructor functions from built-in records</a></li>
<li><a href="#pr-2767">2.5. PR #2767: 2750 Make fn:unparsed-text, &#x2026; nondeterministic</a></li>
<li><a href="#pr-2761">2.6. PR #2761: 2758 Add rules for visibility of named types across packages</a></li>
<li><a href="#pr-2760">2.7. PR #2760: 2521 URIs: unify handling of fragment identifiers</a></li>
<li><a href="#pr-2757">2.8. PR #2757: 2569 Rules for unprefixed function calls with explicit default function ns</a></li>
<li><a href="#pr-2713">2.9. PR #2713: 2257 Record declarations without namespace</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/9]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-170-01: RD to draft a proposal that attempts to address the lexical issues differently.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-172-01: MK to check if the XSLT rules are consistent with the rules in #2757.</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[7/11]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
JWL, BTW, WP give regrets.
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="off"><code>[&#xa0;]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Alan Painter (AP)</li>
<li class="off"><code>[&#xa0;]</code> Wendell Piez (WP)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/07-14.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2026/07-07.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 21 July.
</p>

<p>
No regrets heard
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/9]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="on"><code>[X]</code> QT4CG-167-01: DB to write a PR for #2641, comments in CSV
<ul class="org-ul">
<li>Overtaken by events, see <a href="https://qt4cg.org/dashboard/#pr-2778">#2778</a>.</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-170-01: RD to draft a proposal that attempts to address the lexical issues differently.</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2594">#2594</a>: 2389 Adaptive Serialization: more freedom</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
</ul>
</div>
</div>
