meeting/minutes/2026/07-14.org
*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:ID:       7595B933-3D06-4D83-9519-7218E8A98B16
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2782][#2782]]: 2781b XQFO: outdated examples
+ PR [[https://qt4cg.org/dashboard/#pr-2779][#2779]]: 2781a Fix parsing errors in F&O and XQuery specs
+ PR [[https://qt4cg.org/dashboard/#pr-2771][#2771]]: 2769 Clarify repeatability of random-number-generator() results

Proposal: accept without discussion.

Accepted.

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:ID:       CD205EC0-EFC1-40B2-BE2E-83D3FBBF0413
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2315][#2315]]: Optimization of the workflow action checkout
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2299][#2299]]: Make the pipe-like operators left associative and have the same precedence

Proposal: close with no further action.

Accepted.

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:ID:       8B4339CF-83ED-41FD-8C1E-83A3E84B4AF5
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2784][#2784]]: 2783 fn:pad-string
+ PR [[https://qt4cg.org/dashboard/#pr-2778][#2778]]: 2641b Add support for CSV comments
+ PR [[https://qt4cg.org/dashboard/#pr-2777][#2777]]: 2644 Extend casts to sequences, arrays, maps, and records
+ PR [[https://qt4cg.org/dashboard/#pr-2776][#2776]]: 2769 repeatability of rng next
+ PR [[https://qt4cg.org/dashboard/#pr-2768][#2768]]: 2740 Drop constructor functions from built-in records
+ PR [[https://qt4cg.org/dashboard/#pr-2767][#2767]]: 2750 Make fn:unparsed-text, ... nondeterministic
+ PR [[https://qt4cg.org/dashboard/#pr-2761][#2761]]: 2758 Add rules for visibility of named types across packages
+ PR [[https://qt4cg.org/dashboard/#pr-2760][#2760]]: 2521 URIs: unify handling of fragment identifiers
+ PR [[https://qt4cg.org/dashboard/#pr-2757][#2757]]: 2569 Rules for unprefixed function calls with explicit default function ns
+ PR [[https://qt4cg.org/dashboard/#pr-2739][#2739]]: 2738 XSLT - tree terminology
+ PR [[https://qt4cg.org/dashboard/#pr-2734][#2734]]: 2733 A step too far
+ PR [[https://qt4cg.org/dashboard/#pr-2719][#2719]]: 1234 Serialization Parameters: Indentation, Whitespace, Newlines
+ PR [[https://qt4cg.org/dashboard/#pr-2715][#2715]]: 2653 FLWOR, member/key/value clauses: allow sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2714][#2714]]: 2219 Generalize method calls to sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2713][#2713]]: 2257 Record declarations without namespace
+ PR [[https://qt4cg.org/dashboard/#pr-2712][#2712]]: 2702 Dynamic node tests
+ PR [[https://qt4cg.org/dashboard/#pr-2707][#2707]]: 1962 fn:map-to-element
+ PR [[https://qt4cg.org/dashboard/#pr-2696][#2696]]: 2695 Apply templates to maps, arrays, and JNodes

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:ID:       1DADB821-F041-4D37-A014-02B6FC0A639C
:END:

I’ve put a few new PRs at the top, then the previous ones in the same order as
last week.

** PR #2784: 2783 fn:pad-string
:PROPERTIES:
:CUSTOM_ID: pr-2784
:ID:       507B5CBD-2175-42AB-BF0B-C377A23BB094
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2784][#2784]]

CG introduces the PR.

+ CG: Allows you to pass any atomic, so you can use it to pad numbers.
+ MK: I made a comment about atomization; if you supply a node whose typed value
  is an integer or decimal, you’re going to lose any trailing zeros. I’m not
  sure that’s intuitive behavior.
+ CG: How does ~fn:string-join~ handle this?
+ MK: Yes, it does have the same problem. But I guess it’s consistent.
+ JLO: Is it worth nothing that you shouldn’t allow a zero-width space character.
+ NW: I think that’ll just do the thing.
+ JK: I proposed changing the key word “fill” to “padding” so that it’s clearly a noun.
+ CG: Sounds good to me.
+ MK: An observation on the error conditions; I think you’l get a type error if
  the ~side~ is not a valid member of the enum. So the extra error condition isn’t necessary.

Proposal: accept the PR.

CG will make the two fixes suggested and merge the PR.

** PR #2778: 2641b Add support for CSV comments
:PROPERTIES:
:CUSTOM_ID: pr-2778
:ID:       CCC79519-98E3-4B84-9269-34AF47447B37
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2778][#2778]]

MK introduces the PR. It had to be rewritten in the light of other changes to CSV.

MK reviews the new section 17.5.3 Comments.

+ MK: I also fixed a bug where we forgot to say that the field delimiter must not be a newline.

+ AP: If I want to have the first character in the first column, that I have to quote it?

NW observes that DB is not an “external contributor”! :-)

MK: If you’re going to enable comments, choose a character that doesn’t occur in
the data. But yes, you could quote it.

Proposal: accept the PR.

Accepted.

** PR #2777: 2644 Extend casts to sequences, arrays, maps, and records
:PROPERTIES:
:CUSTOM_ID: pr-2777
:ID:       58EAA552-E0AD-46AD-BEE3-BED0BC6E8A6D
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2777][#2777]]

+ MK: The PR extends casts to all the collective data types.
  + … The proposed rules just use ~cast~ recursively.
+ MK: A ~CastTarget~ is expanded to include ~AnyItemType~, ~TypedArrayType~, etc.
  + … There’s a bit of an issue with ~AnyItemType~ at the top level, but it’s needed to be consistent with recursion.

MK reviews the rules. They’ve been restructured a bit.

+ MK: For backwards compatibility, for casting to list types, we don’t constrain the result by the occurrence indicator. 

+ MK: There’s one other significant change; we used to say that if the input to
  castable can’t be atomized, you get an error. Now you get false.

+ MK: CG raised a comment: if you have a type for a field in your record that
  isn’t a valid cast target, then you can’t do the cast at all.
  + … Having one field like that rules the thing out.
  + … I introduced ~item()~ to deal with that, but it isn’t an adequate solution.
  + CG’s suggestion seems like a better way forward.

MK to revise resubmit.

