meeting/minutes/2026/07-14.html
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2782">#2782</a>: 2781b XQFO: outdated examples</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2779">#2779</a>: 2781a Fix parsing errors in F&amp;O and XQuery specs</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2771">#2771</a>: 2769 Clarify repeatability of random-number-generator() results</li>
</ul>

<p>
Proposal: accept without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2315">#2315</a>: Optimization of the workflow action checkout</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2299">#2299</a>: Make the pipe-like operators left associative and have the same precedence</li>
</ul>

<p>
Proposal: close with no further action.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2784">#2784</a>: 2783 fn:pad-string</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2778">#2778</a>: 2641b Add support for CSV comments</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2777">#2777</a>: 2644 Extend casts to sequences, arrays, maps, and records</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2776">#2776</a>: 2769 repeatability of rng next</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2768">#2768</a>: 2740 Drop constructor functions from built-in records</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2767">#2767</a>: 2750 Make fn:unparsed-text, &#x2026; nondeterministic</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2761">#2761</a>: 2758 Add rules for visibility of named types across packages</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2760">#2760</a>: 2521 URIs: unify handling of fragment identifiers</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2757">#2757</a>: 2569 Rules for unprefixed function calls with explicit default function ns</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2739">#2739</a>: 2738 XSLT - tree terminology</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2734">#2734</a>: 2733 A step too far</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2719">#2719</a>: 1234 Serialization Parameters: Indentation, Whitespace, Newlines</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2715">#2715</a>: 2653 FLWOR, member/key/value clauses: allow sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2714">#2714</a>: 2219 Generalize method calls to sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2713">#2713</a>: 2257 Record declarations without namespace</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2712">#2712</a>: 2702 Dynamic node tests</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2707">#2707</a>: 1962 fn:map-to-element</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2696">#2696</a>: 2695 Apply templates to maps, arrays, and JNodes</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
I’ve put a few new PRs at the top, then the previous ones in the same order as
last week.
</p>
</div>
<div id="outline-container-pr-2784" class="outline-3">
<h3 id="pr-2784"><span class="section-number-3">2.1.</span> PR #2784: 2783 fn:pad-string</h3>
<div class="outline-text-3" id="text-pr-2784">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2784">#2784</a>
</p>

<p>
CG introduces the PR.
</p>

<ul class="org-ul">
<li>CG: Allows you to pass any atomic, so you can use it to pad numbers.</li>
<li>MK: I made a comment about atomization; if you supply a node whose typed value
is an integer or decimal, you’re going to lose any trailing zeros. I’m not
sure that’s intuitive behavior.</li>
<li>CG: How does <code>fn:string-join</code> handle this?</li>
<li>MK: Yes, it does have the same problem. But I guess it’s consistent.</li>
<li>JLO: Is it worth nothing that you shouldn’t allow a zero-width space character.</li>
<li>NW: I think that’ll just do the thing.</li>
<li>JK: I proposed changing the key word “fill” to “padding” so that it’s clearly a noun.</li>
<li>CG: Sounds good to me.</li>
<li>MK: An observation on the error conditions; I think you’l get a type error if
the <code>side</code> is not a valid member of the enum. So the extra error condition isn’t necessary.</li>
</ul>

<p>
Proposal: accept the PR.
</p>

<p>
CG will make the two fixes suggested and merge the PR.
</p>
</div>
</div>
<div id="outline-container-pr-2778" class="outline-3">
<h3 id="pr-2778"><span class="section-number-3">2.2.</span> PR #2778: 2641b Add support for CSV comments</h3>
<div class="outline-text-3" id="text-pr-2778">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2778">#2778</a>
</p>

<p>
MK introduces the PR. It had to be rewritten in the light of other changes to CSV.
</p>

<p>
MK reviews the new section 17.5.3 Comments.
</p>

<ul class="org-ul">
<li>MK: I also fixed a bug where we forgot to say that the field delimiter must not be a newline.</li>

<li>AP: If I want to have the first character in the first column, that I have to quote it?</li>
</ul>

<p>
NW observes that DB is not an “external contributor”! :-)
</p>

<p>
MK: If you’re going to enable comments, choose a character that doesn’t occur in
the data. But yes, you could quote it.
</p>

<p>
Proposal: accept the PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2777" class="outline-3">
<h3 id="pr-2777"><span class="section-number-3">2.3.</span> PR #2777: 2644 Extend casts to sequences, arrays, maps, and records</h3>
<div class="outline-text-3" id="text-pr-2777">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2777">#2777</a>
</p>

<ul class="org-ul">
<li>MK: The PR extends casts to all the collective data types.
<ul class="org-ul">
<li>… The proposed rules just use <code>cast</code> recursively.</li>
</ul></li>
<li>MK: A <code>CastTarget</code> is expanded to include <code>AnyItemType</code>, <code>TypedArrayType</code>, etc.
<ul class="org-ul">
<li>… There’s a bit of an issue with <code>AnyItemType</code> at the top level, but it’s needed to be consistent with recursion.</li>
</ul></li>
</ul>

<p>
MK reviews the rules. They’ve been restructured a bit.
</p>

<ul class="org-ul">
<li>MK: For backwards compatibility, for casting to list types, we don’t constrain the result by the occurrence indicator.</li>

<li>MK: There’s one other significant change; we used to say that if the input to
castable can’t be atomized, you get an error. Now you get false.</li>

<li>MK: CG raised a comment: if you have a type for a field in your record that
isn’t a valid cast target, then you can’t do the cast at all.
<ul class="org-ul">
<li>… Having one field like that rules the thing out.</li>
<li>… I introduced <code>item()</code> to deal with that, but it isn’t an adequate solution.</li>
<li>CG’s suggestion seems like a better way forward.</li>
</ul></li>
</ul>

<p>
MK to revise resubmit.
</p>
</div>
</div>
