meeting/minutes/2026/07-14.org
** PR #2768: 2740 Drop constructor functions from built-in records
:PROPERTIES:
:CUSTOM_ID: pr-2768
:ID:       812F1294-7969-460A-B4A4-925869C2E8A3
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2768][#2768]]

+ CG: We discussed this last week and MK provided some feedback.
  + … I’ve tried to ceate a new version. But it’s failing at the moment.
+ NW: Try restarting the job?
+ CG: I did. Twice. Same fail.
+ CG: Maybe it’s better to look at MK’s comment.
+ MK: I noticed after making that comment that named item types if they are records *do* have a constructor function.
  + … I think we need to have another attempt to bring together named item types and named record types.
+ CG: We use the record constructor functions a lot for user defined record types.
  + … But that doesn’t mean it needs to stay that way.
+ MK: I’m not suggesting removing them, but …

Let’s do some more work on this. We’re digging ourselves into a hole here.

** PR #2767: 2750 Make fn:unparsed-text, ... nondeterministic
:PROPERTIES:
:CUSTOM_ID: pr-2767
:ID:       E3E3C04B-4E62-4AE5-B846-E6395C2328D0
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2767][#2767]]

CG reviews the PR.

+ CG: How do we tackle the potential backwards incompatibility?
  + … We could say this is changed in 4.0, or we have to try to keep it compatible.
+ MK: I’m reasonably comfortable making that incompatibility change.
+ NW: That seems fine to me as well.
+ JK: In 3.0, 3.1 people thought this was deterministic but it wasn’t.
+ MK: I’d have to check to be sure.
+ JK: That observation might be useful in the backwards-incompatibility note.

Proposal: accept the PR.

Accepted.

** PR #2761: 2758 Add rules for visibility of named types across packages
:PROPERTIES:
:CUSTOM_ID: pr-2761
:ID:       5FD2B184-4539-4048-A302-3DAC53ED7FA3
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2761][#2761]]

+ MK: We had all the required syntax in place to say if declared types were public or private, or whatever.
  + … But we didn’t have any text describing the samantics.
  + … They’re fairly intutive, but …
+ MK: One decision that has to be made is, are types “components”.
  + … I decided not to. There’s a lot of stuff about components refering to
    other components, etc. and that doesn’t apply to types.
+ MK: They aren’t components, but they behave a bit like components.
  + … So I slightly fudged it.

MK reviews the semantics in 3.4.7.

+ MK: The rules for schema types are generalized accordingly.

+ JLO: It wasn’t clear to me what happens if I have a type that is private to my
  package but I expose a function that returns that type.
+ MK: You can still call the function; if the type in question is a choice type,
  then you can call it with either of the things in the choice.
  + … Even though the name of the choice type is not visible to you.

You can’t see the name, but you can still manipulate it like a record.

Proposal: accept the PR.

Accepted.

** PR #2760: 2521 URIs: unify handling of fragment identifiers
:PROPERTIES:
:CUSTOM_ID: pr-2760
:ID:       89B512FA-EE8D-4769-961A-BA94EA8A9753
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2760][#2760]]

+ CG: I think there’s nothing new.

Wait until we’ve discussed [[https://github.com/qt4cg/qtspecs/issues/2786][#2786]], my issue about fragment identifiers.

** PR #2757: 2569 Rules for unprefixed function calls with explicit default function ns
:PROPERTIES:
:CUSTOM_ID: pr-2757
:ID:       CF66FCC4-58E7-41F6-AAA2-9C471E665BBD
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2757][#2757]]

+ CG: Gunther observed that the rule about unprefixed function calls made the rules about lookup more complex.
  + … I think if the user has defined a default function namespace, we don’t have to do lookup.
+ CG: This proposal implements that.

CG reviews the rules proposed.

ACTION QT4CG-172-01: MK to check if the XSLT rules are consistent with the rules in #2757.

Proposal: accept the PR.

Accepted.

** PR #2713: 2257 Record declarations without namespace
:PROPERTIES:
:CUSTOM_ID: pr-2713
:ID:       49D169E7-E28A-49E6-9A06-FF8C80ADFE41
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2713][#2713]]

+ CG: When you write scripts, you want to declare records without a prefix.
  + … This PR attempts to define rules for that.

CG reviews the rules.

+ CG: This would certainly make simple scripts easier to write.
+ MK: We’re going for rules that are simple for people who haven’t read them.
  + … Actually understanding these rules is terribly complex.
+ JLO: I think this is useful.

Proposal: accept the PR.

Accepted.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:ID:       18692478-847C-4598-9E52-B93663287FF0
:END:

The pr-archives repository exists: https://github.com/qt4cg/pr-archive/actions

If you check it out and open the ~index.html~ file at the top level, you should see all the PRs.
You probably have to use a webserver.
