meeting/minutes/2026/07-14.html
<div id="outline-container-pr-2768" class="outline-3">
<h3 id="pr-2768"><span class="section-number-3">2.4.</span> PR #2768: 2740 Drop constructor functions from built-in records</h3>
<div class="outline-text-3" id="text-pr-2768">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2768">#2768</a>
</p>

<ul class="org-ul">
<li>CG: We discussed this last week and MK provided some feedback.
<ul class="org-ul">
<li>… I’ve tried to ceate a new version. But it’s failing at the moment.</li>
</ul></li>
<li>NW: Try restarting the job?</li>
<li>CG: I did. Twice. Same fail.</li>
<li>CG: Maybe it’s better to look at MK’s comment.</li>
<li>MK: I noticed after making that comment that named item types if they are records <b>do</b> have a constructor function.
<ul class="org-ul">
<li>… I think we need to have another attempt to bring together named item types and named record types.</li>
</ul></li>
<li>CG: We use the record constructor functions a lot for user defined record types.
<ul class="org-ul">
<li>… But that doesn’t mean it needs to stay that way.</li>
</ul></li>
<li>MK: I’m not suggesting removing them, but …</li>
</ul>

<p>
Let’s do some more work on this. We’re digging ourselves into a hole here.
</p>
</div>
</div>
<div id="outline-container-pr-2767" class="outline-3">
<h3 id="pr-2767"><span class="section-number-3">2.5.</span> PR #2767: 2750 Make fn:unparsed-text, &#x2026; nondeterministic</h3>
<div class="outline-text-3" id="text-pr-2767">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2767">#2767</a>
</p>

<p>
CG reviews the PR.
</p>

<ul class="org-ul">
<li>CG: How do we tackle the potential backwards incompatibility?
<ul class="org-ul">
<li>… We could say this is changed in 4.0, or we have to try to keep it compatible.</li>
</ul></li>
<li>MK: I’m reasonably comfortable making that incompatibility change.</li>
<li>NW: That seems fine to me as well.</li>
<li>JK: In 3.0, 3.1 people thought this was deterministic but it wasn’t.</li>
<li>MK: I’d have to check to be sure.</li>
<li>JK: That observation might be useful in the backwards-incompatibility note.</li>
</ul>

<p>
Proposal: accept the PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2761" class="outline-3">
<h3 id="pr-2761"><span class="section-number-3">2.6.</span> PR #2761: 2758 Add rules for visibility of named types across packages</h3>
<div class="outline-text-3" id="text-pr-2761">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2761">#2761</a>
</p>

<ul class="org-ul">
<li>MK: We had all the required syntax in place to say if declared types were public or private, or whatever.
<ul class="org-ul">
<li>… But we didn’t have any text describing the samantics.</li>
<li>… They’re fairly intutive, but …</li>
</ul></li>
<li>MK: One decision that has to be made is, are types “components”.
<ul class="org-ul">
<li>… I decided not to. There’s a lot of stuff about components refering to
other components, etc. and that doesn’t apply to types.</li>
</ul></li>
<li>MK: They aren’t components, but they behave a bit like components.
<ul class="org-ul">
<li>… So I slightly fudged it.</li>
</ul></li>
</ul>

<p>
MK reviews the semantics in 3.4.7.
</p>

<ul class="org-ul">
<li>MK: The rules for schema types are generalized accordingly.</li>

<li>JLO: It wasn’t clear to me what happens if I have a type that is private to my
package but I expose a function that returns that type.</li>
<li>MK: You can still call the function; if the type in question is a choice type,
then you can call it with either of the things in the choice.
<ul class="org-ul">
<li>… Even though the name of the choice type is not visible to you.</li>
</ul></li>
</ul>

<p>
You can’t see the name, but you can still manipulate it like a record.
</p>

<p>
Proposal: accept the PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2760" class="outline-3">
<h3 id="pr-2760"><span class="section-number-3">2.7.</span> PR #2760: 2521 URIs: unify handling of fragment identifiers</h3>
<div class="outline-text-3" id="text-pr-2760">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2760">#2760</a>
</p>

<ul class="org-ul">
<li>CG: I think there’s nothing new.</li>
</ul>

<p>
Wait until we’ve discussed <a href="https://github.com/qt4cg/qtspecs/issues/2786">#2786</a>, my issue about fragment identifiers.
</p>
</div>
</div>
<div id="outline-container-pr-2757" class="outline-3">
<h3 id="pr-2757"><span class="section-number-3">2.8.</span> PR #2757: 2569 Rules for unprefixed function calls with explicit default function ns</h3>
<div class="outline-text-3" id="text-pr-2757">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2757">#2757</a>
</p>

<ul class="org-ul">
<li>CG: Gunther observed that the rule about unprefixed function calls made the rules about lookup more complex.
<ul class="org-ul">
<li>… I think if the user has defined a default function namespace, we don’t have to do lookup.</li>
</ul></li>
<li>CG: This proposal implements that.</li>
</ul>

<p>
CG reviews the rules proposed.
</p>

<p>
ACTION QT4CG-172-01: MK to check if the XSLT rules are consistent with the rules in #2757.
</p>

<p>
Proposal: accept the PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2713" class="outline-3">
<h3 id="pr-2713"><span class="section-number-3">2.9.</span> PR #2713: 2257 Record declarations without namespace</h3>
<div class="outline-text-3" id="text-pr-2713">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2713">#2713</a>
</p>

<ul class="org-ul">
<li>CG: When you write scripts, you want to declare records without a prefix.
<ul class="org-ul">
<li>… This PR attempts to define rules for that.</li>
</ul></li>
</ul>

<p>
CG reviews the rules.
</p>

<ul class="org-ul">
<li>CG: This would certainly make simple scripts easier to write.</li>
<li>MK: We’re going for rules that are simple for people who haven’t read them.
<ul class="org-ul">
<li>… Actually understanding these rules is terribly complex.</li>
</ul></li>
<li>JLO: I think this is useful.</li>
</ul>

<p>
Proposal: accept the PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
The pr-archives repository exists: <a href="https://github.com/qt4cg/pr-archive/actions">https://github.com/qt4cg/pr-archive/actions</a>
</p>

<p>
If you check it out and open the <code>index.html</code> file at the top level, you should see all the PRs.
You probably have to use a webserver.
</p>
</div>
</div>
</div>
</body>
</html>
